singhanil2004/RL78_Kwh_Meter/rl78i1c/application/display_button/lcd/em_display.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
* No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
* OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
* NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
* LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
* INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
* ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability
* of this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2013, 2015 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/***********************************************************************************************************************
* File Name    : em_display.c
* Version      : 1.00
* Device(s)    : RL78/I1C
* Tool-Chain   : CA78K0R
* H/W Platform : RL78/I1C Energy Meter Platform
* Description  : EM Display Application Layer APIs
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "stdio.h"
/* Driver layer */
#include "r_cg_macrodriver.h"
#include "r_cg_userdefine.h"
#include "typedef.h"            /* GCSE Standard definitions */
#include "r_cg_wdt.h"

/* Application layer */
#include "platform.h"
#include "em_display.h"         /* EM Display Application Layer */
//#include "powermgmt.h"
#include "user_config.h"

/* Display tamper condition */
#include "format.h"
#include "eeprom.h"
#include "em_core.h"
#include "LCD_Segment.h"
#include "inst_read.h"
#include "key.h"
#include "r_calib.h"
#include "config_storage.h"
/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/


/***********************************************************************************************************************
Imported global variables and functions (from other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Exported global variables and functions (to be accessed by other files)
***********************************************************************************************************************/
volatile uint8_t g_KeyScan_Flg;
volatile uint8_t g_Display_Refresh_Flg;
/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
static void EM_DisplayNormalMode(void);
static void EM_DisplayProgMode(void);
static void EM_DisplaySelfTest(void);
static void EM_LCD_DisplayEBEnergy(void);
static void EM_LCD_DisplayDGEnergy(void);
static void EM_LCD_DisplayActPower(void);
static void EM_LCD_DisplayAppPower(void);
static void EM_LCD_DisplayPF(void);
static void EM_LCD_DisplayRunHour(void);
static void EM_LCD_Password(void);
static void EM_LCD_DisplayCtr(void);
static void EM_LCD_DisplayCtrNormal(void);
static void EM_LCD_DisplayModbusId(void);
static uint32_t abs(int32_t input);
static uint8_t BCD2DEC(uint8_t BCD_number);

static uint16_t     g_em_display_count = LCD_DELAY_TIME;
static uint8_t      g_is_display_changed_next = 1;
static int8_t       g_DispCounter = 0;  /* first position is voltage */
static uint8_t      g_auto_roll = 1;
static uint8_t      g_prog_mode = 0;
static int8_t       g_blink_digit = 0;
static int8_t       s_count = 0;
uint8_t             g_eng_decimal;
static uint16_t     s_password = 0;
typedef void (* __far fp_display_t)(void);
static const uint16_t  digit_weight[5] = {1, 10, 100, 1000, 1};
static const uint16_t  decimal_weight[5] = {1000, 100, 10, 1, 1};
/*
* Display list, scroll over at end
* Append or move the display API inside this list for arrangement
* of LCD display
*/
const fp_display_t fp_display[] =
{
    EM_DisplaySelfTest,
    EM_LCD_DisplayEBEnergy,
#ifdef DUAL_SOURCE
    EM_LCD_DisplayDGEnergy,
#endif
    EM_LCD_DisplayActPower,
    EM_LCD_DisplayAppPower,
    EM_LCD_DisplayPF,
    EM_LCD_DisplayRunHour,
    NULL,
    EM_LCD_DisplayCtrNormal,
    NULL,
};
const fp_display_t fp_prog_display[] =
{
    EM_LCD_Password,
    EM_LCD_DisplayCtr,
    EM_LCD_DisplayModbusId,
    NULL,
};
