singhanil2004/RL78_Kwh_Meter/rl78i1c/application/display_button/lcd/em_display.c
/***********************************************************************************************************************
* Function Name: void EM_DisplaySequence(void)
* Description  :
* Arguments    :
* Output       :
* Return Value :
***********************************************************************************************************************/
void EM_DisplaySequence(void)
{
    if (g_prog_mode)
    {
        EM_DisplayProgMode();
    }
    else
    {
        EM_DisplayNormalMode();
    }
}
/***********************************************************************************************************************
* Function Name: void EM_DisplayNormalMode(void)
* Description  : This function display Normal Parameter
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
void EM_DisplayNormalMode(void)
{
    if (g_Display_Refresh_Flg)
    {
        g_Display_Refresh_Flg = 0;
        s_count++;
        
        if (s_count < 2)
        {
            return;
        }
        
        s_count = 0;
        INST_READ_RTC_InterruptCallBack();
        
        if (g_auto_roll)
        {
            g_em_display_count++;   /* Counter used for displaying measured value */
            
            if (g_em_display_count > LCD_DELAY_TIME)
            {
                LCD_ChangeNext();
                g_auto_roll = 0;
            }
        }
        else if (g_em_display_count)
        {
            g_em_display_count--;
            
            if (g_em_display_count == 0)
            {
                g_DispCounter = 1;
            }
        }
        
        /* Display the parameter */
        if (fp_display[g_DispCounter] != NULL)
        {
            (fp_display[g_DispCounter])();
        }
        
        R_WDT_Restart();
    }
    
    if (g_key_flag.Byte)
    {
        if (g_key_flag.Bits.is_key_2_pressed == 1)
        {
            if (g_auto_roll == 0)
            {
                LCD_ChangeNext();
                g_em_display_count = LCD_DELAY_TIME;
            }
        }
        else if (g_key_flag.Bits.is_key_3_pressed == 1)
        {
#ifdef DUAL_SOURCE
            g_DispCounter = 7;
#else
            g_DispCounter = 6;
#endif
            
            LCD_ChangeNext();
            g_em_display_count = 3;
        }
        
        g_key_flag.Byte = 0;
    }
    
    R_WDT_Restart();
}
/***********************************************************************************************************************
* Function Name: void EM_DisplayProgMode(void)
* Description  : This function display Normal Parameter
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
void EM_DisplayProgMode(void)
{
    if (g_Display_Refresh_Flg)
    {
        g_Display_Refresh_Flg = 0;
        
        /* Display the parameter */
        if (fp_prog_display[g_DispCounter] != NULL)
        {
            (fp_prog_display[g_DispCounter])();
        }
        
        R_WDT_Restart();
        
        if (g_em_display_count)
        {
            g_em_display_count--;
            
            if (g_em_display_count == 0) // if not exit manual from prog
            {
                g_DispCounter = 1;
                g_prog_mode = 0;
                CONFIG_Restore(CONFIG_ITEM_USER);
            }
        }
    }
    
    if (g_key_flag.Byte)
    {
        g_em_display_count = LCD_DELAY_TIME * 2; // restart time out
        
        if (g_key_flag.Bits.is_key_3_pressed == 1)
        {
            g_key_flag.Bits.is_key_3_pressed = 0;
            
            if (g_DispCounter == 0)
            {
                if (s_password != 1234)
                {
                    s_password = 0;
                    g_DispCounter = -1;
                }
            }
            
            g_DispCounter++;   /* Counter used for displaying measured value */
            
            if (g_DispCounter == 2) // Modbus ID
            {
                if (g_modbusmode == 0)
                {
                    g_DispCounter++; //Skip Modbus ID Display
                }
            }
            
            if (fp_prog_display[g_DispCounter] == NULL)
            {
                g_DispCounter = 1;
            }
            
            if (g_DispCounter < 2)
            {
                g_blink_digit = 3;
            }
            else
            {
                g_blink_digit = 2;
            }
            
            (fp_prog_display[g_DispCounter])();
        }
        
        if (g_key_flag.Bits.is_key_2_pressed == 1)
        {
            g_key_flag.Bits.is_key_2_pressed = 0;
            g_blink_digit--;
            
            if (g_blink_digit < 0)
            {
                if (g_DispCounter < 2)
                {
                    g_blink_digit = 3;
                }
                else
                {
                    g_blink_digit = 2;
                }
            }
        }
        
        g_Display_Refresh_Flg = 1;
    }
}
/***********************************************************************************************************************
* Function Name: void LCD_RTC_InterruptCallback(void)
* Description  : This function is called by RTC to increase the counter which
*              : is used to control the displayed time of variable
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
void EM_RTC_DisplayInterruptCallback(void)
{
    //g_em_display_count++;   /* Counter used for displaying measured value */
}

/******************************************************************************
* Function Name: void EM_DisplaySelfTest(void)
* Description  : Display unit code on LCD screen (now, it is fixed RE0001)
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_DisplaySelfTest(void)
{
    display_array[0] = CODE_u;
    display_array[1] = CODE_E;
    display_array[2] = CODE_r;
    display_array[3] = 1;
    display_array[4] = 0;
    display_array[5] = 0;
    display_dot[0] = FALSE;
    display_dot[1] = FALSE;
    display_dot[2] = FALSE;
    display_dot[3] = TRUE;
    display_dot[4] = FALSE;
    display_dot[5] = FALSE;
}
/******************************************************************************
* Function Name: void EM_DisplaySelfTest(void)
* Description  : Display unit code on LCD screen (now, it is fixed RE0001)
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
void EM_DisplayCalibStatus(uint32_t CalStatus)
{
    if (CalStatus > 4)
    {
        g_DispCounter = 1;
        display_array[0] = CODE_BLANK;
        display_array[1] = CODE_d;
        display_array[2] = CODE_o;
        display_array[3] = CODE_n;
        display_array[4] = CODE_E;
        display_array[5] = CODE_BLANK;
    }
    else
    {
        display_array[0] = CODE_C;
        display_array[1] = CODE_A;
        display_array[2] = CODE_L;
        display_array[3] = CODE_DASH;
        display_array[4] = CalStatus;
        display_array[5] = CODE_BLANK;
        display_dot[0] = FALSE;
        display_dot[1] = FALSE;
        display_dot[2] = FALSE;
        display_dot[3] = FALSE;
        display_dot[4] = FALSE;
        display_dot[5] = FALSE;
    }
    
