singhanil2004/RL78_Kwh_Meter/rl78i1c/application/display_button/lcd/em_display.c
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayEBEnergy(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayEBEnergy(void)
{
    uint32_t data;
    data = (uint32_t)(MainsEnergies.active_imp / decimal_weight[g_eng_decimal]);
	//data = (uint32_t)(g_inst_read_params.vrms[0]*10 / decimal_weight[g_eng_decimal]);
    g_led_flag.Byte = 0;
    
    if (LVDVRTCF == 0)
    {
        g_led_flag.Bits.KWh_DG = 1;
    }
    else
    {
        g_led_flag.Bits.KWh_DG = 0;
    }
    
    g_led_flag.Bits.KWh_EB = 1;
    //g_led_flag.Bits.Unit_K = 1;
    //g_led_flag.Bits.Unit_W = 1;
    display_6Digit(data, g_eng_decimal);
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayDGEnergy(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayDGEnergy(void)
{
    uint32_t data = (uint32_t)(MainsEnergies.active_exp / decimal_weight[g_eng_decimal]);
    g_led_flag.Byte = 0;
    g_led_flag.Bits.KWh_DG = 1;
    //g_led_flag.Bits.Unit_K = 1;
    //g_led_flag.Bits.Unit_W = 1;
    display_6Digit(data, g_eng_decimal);
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayDGEnergy(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayActPower(void)
{
    uint32_t data;
    g_led_flag.Byte = 0;
    data = abs(g_inst_read_params.active_power[LINE_TOTAL] / decimal_weight[2]);
    //g_led_flag.Bits.Unit_K = 1;
    g_led_flag.Bits.Unit_W = 1;
    display_6Digit(data, 2);
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayAppPower(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayAppPower(void)
{
    uint32_t data;
    g_led_flag.Byte = 0;
    data = abs(g_inst_read_params.apparent_power[LINE_TOTAL] / decimal_weight[2]);
    //g_led_flag.Bits.Unit_K = 1;
    g_led_flag.Bits.Unit_VA = 1;
    display_6Digit(data, 2);
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayPF(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayPF(void)
{
    uint32_t data = abs(g_inst_read_params.power_factor[LINE_TOTAL]);
    g_led_flag.Byte = 0;
    g_led_flag.Bits.Unit_PF = 1;
    display_PF(data, 3);
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayRunHour(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayRunHour(void)
{
    uint32_t data;;
    data = (MainsEnergies.run_hour / 3600) * 100 + ((MainsEnergies.run_hour / 60) % 60);
    g_led_flag.Byte = 0;
    g_led_flag.Bits.Unit_H = 1;
    display_6Digit(data, 2);
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayCtr(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayCtr(void)
{
    uint32_t  data;
    
    if (g_key_flag.Bits.is_key_1_pressed == 1)
    {
        g_key_flag.Bits.is_key_1_pressed = 0;
        data = (user_config.CTR / digit_weight[g_blink_digit]);
        user_config.CTR += (((data + 1) % 10) - (data % 10)) * digit_weight[g_blink_digit];
        
        if (user_config.CTR < 5)
        {
            user_config.CTR = 5;
        }
    }
    
    display_CTR(user_config.CTR, g_blink_digit, 0);
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayCtrNormal(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayCtrNormal(void)
{
    display_CTR(user_config.CTR, 0xff, 0);
}
/******************************************************************************
* Function Name: void EM_LCD_Password(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_Password(void)
{
    uint32_t  data;
    
    if (g_key_flag.Bits.is_key_1_pressed == 1)
    {
        g_key_flag.Bits.is_key_1_pressed = 0;
        data = (s_password / digit_weight[g_blink_digit]);
        s_password += (((data + 1) % 10) - (data % 10)) * digit_weight[g_blink_digit];
    }
    
    display_CTR(s_password, g_blink_digit, 1u);
}
/******************************************************************************
* Function Name: void EM_LCD_DisplayModbusId(void)
* Description  : Display unit code on LCD screen
* Arguments    : none
* Output       : none
* Return Value : none
******************************************************************************/
static void EM_LCD_DisplayModbusId(void)
{
    uint32_t  data;
    
