singhanil2004/RL78_Kwh_Meter/rl78i1c/application/display_button/lcd/em_display.c
    if (g_key_flag.Bits.is_key_1_pressed == 1)
    {
        g_key_flag.Bits.is_key_1_pressed = 0;
        data = (user_config.ModbusID / digit_weight[g_blink_digit]);
        user_config.ModbusID += (((data + 1) % 10) - (data % 10)) * digit_weight[g_blink_digit];
        
        if (user_config.ModbusID > 250)
        {
            user_config.ModbusID = 18;
        }
    }
    
    display_Modbus_ID(user_config.ModbusID, g_blink_digit);
}
/******************************************************************************
* Function Name: void EM_SwitchAutoRoll(void)
* Description  : Toogle between using auto roll and not use auto roll
* Arguments    : none
* Output       : [g_auto_roll]: flag to determine if using auto roll or not
* Return Value :
******************************************************************************/
void LCD_SwitchAutoRoll(void)
{
    /* Toogle auto scroll flag */
    g_auto_roll ^= 0x1;
    /* Reset display counter */
    g_em_display_count = 0;
}
/******************************************************************************
* Function Name: void LCD_SwitchProgMode(void)
* Description  : Toogle between using Programming Mode
* Arguments    : none
* Output       : None
* Return Value :
******************************************************************************/
void LCD_SwitchProgMode(void)
{
    /* Toogle Prog mode */
    g_prog_mode ^= 0x1;
    
    if (g_prog_mode == 0) /*Exit from Prog Mode then Save Config */
    {
        if (CONFIG_Backup(CONFIG_ITEM_USER) != EM_OK)
        {
        }
        
        INST_UpdateMultiplyfactor();
        g_DispCounter = 1;
    }
    else
    {
        g_DispCounter = 0;
        s_password = 0;
    }
    
    g_blink_digit = 3;
    g_em_display_count = LCD_DELAY_TIME * 2; // restart time out
    display_dot[0] = FALSE;
    display_dot[1] = FALSE;
    display_dot[2] = FALSE;
    display_dot[3] = FALSE;
    display_dot[4] = FALSE;
    display_dot[5] = FALSE;
    display_array[6] = 0xFF;
}

/******************************************************************************
* Function Name: void EM_ChangeNext(void)
* Description  : Switch to the next display value on EM
* Arguments    : none
* Output       : [g_display_pos] determine the order of displayed information
*              : [g_em_display_count] the counter for displaying
* Return Value : none
******************************************************************************/
void LCD_ChangeNext(void)
{
    g_DispCounter++;
    g_is_display_changed_next = 1;
    
    if (fp_display[g_DispCounter] == NULL)
    {
        g_DispCounter = 1;
    }
    
    display_dot[0] = FALSE;
    display_dot[1] = FALSE;
    display_dot[2] = FALSE;
    display_dot[3] = FALSE;
    display_dot[4] = FALSE;
    display_dot[5] = FALSE;
    g_led_flag.Byte = 0;
    (fp_display[g_DispCounter])();
}

/* Display some extra information */

/*****************************************************************************************
* function      : uint8_t BCD2DEC(uint8_t BCD_number)
* description   : This function is used to convert the BCD number into decimal number
* input         : [decimal_number] : the normal number in decimal type
* output        : none
* return        : the number in BCD type
*******************************************************************************************/
static uint8_t BCD2DEC(uint8_t BCD_number)
{
    volatile uint8_t rts;
    
    rts = (uint8_t)(BCD_number & 0x0f);
    BCD_number = (uint8_t)(((BCD_number & 0xf0) >> 4) * 10);
    rts = (uint8_t)(rts + BCD_number);
    return rts;
}

/*****************************************************************************************
* function      : static float abs(float input)
* description   : This function returns abs value of [input]
* input         : [input] number which need to be get abs value
* output        : none
* return        : abs value of [input]
*******************************************************************************************/
static uint32_t abs(int32_t input)
{
    if (input < 0)
    {
        return (-input);
    }
    else
    {
        return (input);
    }
}
/*****************************************************************************************
* function      : EM_DisplayTimerCallback
* description   : This function call from 1 ms timer
* input         : none
* output        : none
* return        : none
*******************************************************************************************/
void EM_Timer_DisplayInterruptCallback(void)
{
    /* Start user code. Do not edit comment generated here */
    static uint8_t display_index;
    static uint16_t  msCnt = 0;
    
    
    /* Update Display */
    /*Select Digit*/
    LCD_Q1_Q5_PORT = 0xFF;
    //SET_BIT(LCD_Q6_PORT,LCD_Q6,1);
    LCD_Q6_PORT |= (1 << LCD_Q6);
    LCD_Q7_PORT |= (1 << LCD_Q7);
    
    if (display_index < 5)
    {
        LCD_Q1_Q5_PORT &= ~(1 << display_index);
    }
    else
    {
        //SET_BIT(LCD_Q6_PORT,LCD_Q6,0);
        LCD_Q6_PORT &= ~(1 << (display_index + 1));
    }
    
    if (display_index > 5)
    {
        LCD_DATA_PORT   =   display_array[display_index];
    }
    else
    {
        if (display_dot[display_index] == TRUE)
        {
            LCD_DATA_PORT   = (look_up_display[display_array[display_index]]) & 0x7F; // Data
        }
        else
        {
            LCD_DATA_PORT   =   look_up_display[display_array[display_index]]; // Data
        }
    }
    
    display_index++;
    
    if (display_index > 6)
    {
        display_index = 0;
    }
    
    msCnt++;
    
    if ((msCnt % 31) == 0)
    {
        g_KeyScan_Flg = 1;
#if 1
        
        if ((msCnt % 248) == 0)
        {
            if (R_CALIB_IsInCalibMode() == 1)
            {
                EM_CALIB_RTCConstantInterruptCallback();
            }
            
            g_Display_Refresh_Flg = 1;
            msCnt = 0;
        }
        
#else
        msCnt = 0;
#endif
        
    }
}


